# RebarElemHostMark Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarElemHostMark Property
ParameterTypeId Class See Also
---
"Host Mark"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarElemHostMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarElemHostMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarElemHostMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace